# DpartMaterialByOriginal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DpartMaterialByOriginal Property
ParameterTypeId Class See Also
---
"Material By Original"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DpartMaterialByOriginal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DpartMaterialByOriginal As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DpartMaterialByOriginal {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace